export const letterColors: Record<string, string> = {
  А: "#FF4C4C", // красный
  Б: "#FF6D00", // оранжевый
  В: "#FFEA00", // жёлтый
  Г: "#00E676", // зелёный
  Д: "#00B0FF", // голубой
  Е: "#2979FF", // синий
  Ё: "#7C4DFF", // фиолетовый
  Ж: "#F50057", // розовый
  З: "#00C853", // ярко-зелёный
  И: "#D50000", // алый
  Й: "#FF9100", // светло-оранжевый
  К: "#FFD600", // лимонный
  Л: "#1DE9B6", // бирюзовый
  М: "#0091EA", // небесно-голубой
  Н: "#304FFE", // тёмно-синий
  О: "#651FFF", // пурпурный
  П: "#C51162", // малиновый
  Р: "#00E5FF", // ярко-голубой
  С: "#76FF03", // салатовый
  Т: "#FF1744", // красно-розовый
  У: "#FFAB00", // янтарный
  Ф: "#AEEA00", // лаймовый
  Х: "#00BFA5", // морская волна
  Ц: "#3D5AFE", // насыщенно-синий
  Ч: "#AA00FF", // фиолетовый
  Ш: "#D81B60", // розовый малиновый
  Щ: "#64DD17", // ярко-зелёный
  Ъ: "#FF3D00", // огненно-оранжевый
  Ы: "#FFC400", // золотисто-жёлтый
  Ь: "#00C853", // травяной зелёный
  Э: "#2962FF", // чистый синий
  Ю: "#6200EA", // тёмно-фиолетовый
  Я: "#E91E63", // розовый
};
